doc/adr/0005-use-the-marklogic-library-services-api-for-document-versioning.md
```mermaid
sequenceDiagram
  participant Transformation
  participant Enrichment
  participant AdminUI
  participant Marklogic
  participant PublicUI
  Transformation->>Marklogic: Insert managed document
  Marklogic-->>Transformation: OK: v1
  Enrichment->>Marklogic: Check out
  Marklogic-->>Enrichment: OK: v1
  Enrichment->>Marklogic: Update
  Marklogic-->>Enrichment: OK: v2
  AdminUI->>Marklogic: Atomic checkout/update/checkin
  Marklogic-->>AdminUI: DENIED
  PublicUI->>Marklogic: Read
  Marklogic-->>PublicUI: OK: v2
  Enrichment->>Marklogic: Update
  Marklogic-->>Enrichment: OK: v3
  Enrichment->>Marklogic: Check in
  Marklogic-->>Enrichment: OK
  AdminUI->>Marklogic: Atomic checkout/update/checkin
  Marklogic-->>AdminUI: OK: v4
  PublicUI->>Marklogic: Read
  Marklogic-->>PublicUI: OK: v4
```
